import Link from 'next/link'
import Head from 'next/head'
import Button from '@/components/modules/SalesSteps/Button';

export default function index() {
  return (
    <>
    <Head>
    <title>مراحل فروش خانه - دابزهوم</title>
    </Head>
    
    <div className='text-[#000929] grid px-4'>
      <div className="sm:mt-[5rem] mt-[3rem] p-[1.8rem] lg:w-[880px] w-full bg-white border border-[#E0DEF7] rounded-[16px] sm:mx-auto grid">
      
      <svg className='mx-auto' width="215" height="105" viewBox="0 0 215 105" fill="none" xmlns="http://www.w3.org/2000/svg">
      <rect x="33.2734" y="93.0234" width="38.3929" height="11.0437" rx="5.52183" fill="#ECFAF2"/>
      <rect x="125.418" y="12.7422" width="48.631" height="11.0437" rx="5.52183" fill="#ECFAF2"/>
      <rect x="69.9609" y="33.1328" width="122.857" height="11.0437" rx="5.52183" fill="#ECFAF2"/>
      <rect x="24.7422" y="53.5195" width="154.425" height="11.0437" rx="5.52183" fill="#ECFAF2"/>
      <rect x="104.941" y="44.1719" width="49.4841" height="9.34464" rx="4.67232" fill="#ECFAF2"/>
      <rect x="37.5391" y="64.5625" width="49.4841" height="9.34464" rx="4.67232" fill="#ECFAF2"/>
      <rect y="73.9062" width="95.5555" height="9.34464" rx="4.67232" fill="#ECFAF2"/>
      <rect x="163.809" width="15.3571" height="7.64561" rx="3.82281" fill="#ECFAF2"/>
      <rect x="199.645" y="49.2695" width="15.3571" height="7.64561" rx="3.82281" fill="#ECFAF2"/>
      <rect x="128.832" y="5.09766" width="15.3571" height="7.64561" rx="3.82281" fill="#ECFAF2"/>
      <path d="M144.54 81.5523C144.54 83.6199 142.856 85.2998 140.774 85.2998C138.692 85.2998 137.008 83.6199 137.008 81.5523C137.008 79.4846 138.692 77.8047 140.774 77.8047C142.856 77.8047 144.54 79.4846 144.54 81.5523Z" stroke="#38C976"/>
      <ellipse cx="108.352" cy="55.2196" rx="27.3016" ry="27.1844" fill="#C4EFD6"/>
      <path d="M94.7422 53.8755L102.394 61.4945L117.698 45.168" stroke="#38C976" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
      <path d="M73.7232 11.8921C73.7232 13.9598 72.0391 15.6397 69.9573 15.6397C67.8754 15.6397 66.1914 13.9598 66.1914 11.8921C66.1914 9.8244 67.8754 8.14453 69.9573 8.14453C72.0391 8.14453 73.7232 9.8244 73.7232 11.8921Z" stroke="#38C976"/>
      <path d="M87.9218 32.8289C87.5957 32.4748 87.0425 32.4506 86.6969 32.7871C81.8623 37.4942 78.9461 43.8301 78.5339 50.5711C78.1039 57.6022 80.4318 64.525 85.0271 69.8808C89.6224 75.2366 96.1261 78.6072 103.168 79.2824C110.21 79.9576 117.24 77.8847 122.777 73.5004C128.315 69.1161 131.927 62.7629 132.852 55.7792C133.777 48.7956 131.944 41.727 127.739 36.0627C123.533 30.3984 117.283 26.5807 110.307 25.4141C103.619 24.2959 96.7644 25.697 91.0703 29.325C90.6617 29.5853 90.5601 30.1321 90.8344 30.53C91.1073 30.926 91.6493 31.0249 92.0564 30.7666C97.3769 27.3914 103.775 26.0899 110.017 27.1336C116.546 28.2253 122.395 31.7981 126.331 37.0991C130.266 42.4002 131.982 49.0154 131.116 55.5512C130.25 62.0869 126.87 68.0327 121.688 72.1358C116.506 76.2388 109.926 78.1788 103.336 77.5469C96.7456 76.915 90.659 73.7606 86.3584 68.7483C82.0579 63.736 79.8793 57.2572 80.2816 50.677C80.6661 44.3889 83.3789 38.4774 87.8772 34.0766C88.2235 33.7378 88.2493 33.1845 87.9218 32.8289Z" fill="#38C976"/>
      </svg>
      <h2 className='mx-auto mt-5 sm:text-[20px] text-[16px] font-bold text-[#1BA781]'>درخواست شما ثبت شد!</h2>
      <p className='lg:w-[62%] text-center mx-auto mt-5 sm:text-[18px] text-[14px] text-[#232F43]'>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، 
و با استفاده ازطراحان گرافیک است</p>
      </div>

      <Button title='بازگشت به صفحه اول' route='/'/>
    </div>
    </>
  )
}

